Lectures.org
#+SETUPFILE: ./setup.org
#+HUGO_SECTION: slides
#+HUGO_MENU: :menu main :parent Assignments
#+REVEAL_SINGLE_FILE: t
#+REVEAL_ROOT: file:///home/matt/src/reveal.js
#+ORG_LMS_SECTION: lecture
# #+OPTIONS: reveal_single_file:t

* 3.3 Javascript Data Structures
:PROPERTIES:
:EXPORT_FILE_NAME: 03-03-js-data
:END:
** Arrays
#+begin_src js
let myArray = ["some",
               "collection",
               "of", 
               "things",
               4,
               7,
               3458,
               ["a", "sub", "array"],
               "pretty",
               "random"
               ]
#+end_src
- an array is a *list* of *elements* separated by *commas*, and delimited by ~[]~
- note 3 kinds of elements in this particular array:
  - string: collection of characters delimited by ~""~
  - number: numerals only, no quotes
  - array: one of the array elements is itself an array!
** Objects
#+begin_src javascript
{
  title: "I am a collection of key-value pairs",
  separation: "always separated by commas",
  possibleValues: ["value", "can", "be", "any", "javascript", "data structure"],
  evenOtherObjects: {
    subvalue1: "Even other objects",
    subvalue2: 234098,
    subvalue3: "This is getting silly"
  },
  "propertyNamesCanBeQuoted": "Not really a good idea but we do it anyway"
}
#+end_src
- key-value pairs
- separated by commas (remember: CSS rule separator is semi-colon, JS object property separator is comma)
- value can itself be a complex data structure
** In our Assignment
#+begin_src json
{
    "type": "stanza",
    "class": "",
    "content": [
      {
        "type": "line",
        "class": "",
        "content": [
          {"type": "word", "content": "Everywhere", "class": "", "meta": ""},
          {"type": "word", "content": "lies", "class": "", "meta": ""},
          {"type": "word", "content": "a", "class": "", "meta": ""},
          {"type": "word", "content": "corpse", "meta": ""},
          {"type": "punctuation", "content": ",", "class": "", "meta": ""},
          {"type": "word", "content": "mourned", "class": "", "meta": ""}
        ]
      },
      {
        "type": "line",
        "class": "",
        "content": [
          {"type": "word", "content": "without", "class": "", "meta": ""},
          {"type": "word", "content": "a", "class": "", "meta": ""},
          {"type": "word", "content": "eulogy", "class": "", "meta": "How do we think of a eulogy?"},
          {"type": "word", "content": "or", "class": "", "meta": ""},
          {"type": "word", "content": "a", "class": "", "meta": ""},
          {"type": "word", "content": "moment", "class": "", "meta": ""},
          {"type": "word", "content": "of", "class": "", "meta": ""},
          {"type": "word", "content": "silence", "class": "", "meta": ""},
          {"type": "punctuation", "content": ".", "class": "", "meta": ""}
        ]
      }
    ]
  }
#+end_src
** Your Task: JS part
- *add classes to relevant components*
- *consider adding meta, if you want to explain something*
- also possible to add new elements!
#+begin_src json
{
    "type": "stanza",
    "class": "",
    "content": [
      {
        "type": "line",
        "class": "",
        "content": [
          {"type": "word", "content": "without", "class": "", "meta": ""},
          {"type": "word", "content": "a", "class": "", "meta": ""},
          {"type": "word", "content": "eulogy", "class": "death", "meta": ""},
          {"type": "word", "content": "or", "class": "", "meta": ""},
          {"type": "word", "content": "a", "class": "", "meta": ""},
          {"type": "phrase", "class": "",
           "meta": "To be without a moment of silence, amidst the grieving; the agony is awful",
           "content": [
             {"type": "word", "content": "moment", "class": "time", "meta": ""},
             {"type": "word", "content": "of", "class": "", "meta": ""},
             {"type": "word", "content": "silence", "class": "", "meta": ""}
           ]},
          {"type": "punctuation", "content": ".", "class": "", "meta": ""}
        ]
      }
    ]
  }
#+end_src
